#include <iostream>
using namespace std;
int main()
{
setlocale(LC_ALL, "rus");
//Задача 1,Begin12: Дана площа S кола. Знайти його діаметр D і довжину L кола, що обмежує це коло, з огляду на, що L = π · D, S = π · D2 Значення π вважати рівним 3.14.
cout << "Перша задача" << endl;
double S;
//Введення данних
cout << "Введіть площу кола: " << endl;
cin >> S;
//Розрахунки
int D = 4*S/3.14;  
int L = 3.14*D;
//Виведення данних
cout << "Діаметр кола:"<< D << endl;
cout << "Довжина кола:"<< L << endl;
//Задача 2, Begin20: Дано число A. Обчислити A15, використовуючи дві допоміжні змінні і п'ять операцій множення. Для цього послідовно знайдіть A2, A3, A5, A10, A15. Вивести всі знайдені степені числа A.
cout << "Друга задача" << endl;
double A;
//Введення данних
cout << "Введіть число: ";
cin >> A;
//Розрахунки
int A2 = A*A;
int A3 = A2*A;
int A5 = A3*A2;
int A10 = A5*A5;
int A15 = A10*A5;
cout << "A^2: "<< A2 << endl;
cout << "A^3: "<< A3 << endl;
cout << "A^5: "<< A5 << endl;
cout << "A^10: "<< A10 << endl;
cout << "A^15: "<< A15 << endl;
return 0;
}